NSCameraUsageDescription = "Kamera video qo'ng'iroqlarda ishlatiladi";
NSMicrophoneUsageDescription = "Mikrofon ovozli va video qo'ng'iroqlarda ishlatiladi";
NSPhotoLibraryUsageDescription = "Qurilmangizdagi rasm va videolarni almashish uchun Foto kutubxonasiga kirish kerak";
NSContactsUsageDescription = "Manzillar kitobi kontaktlarini serveringizdagi kontaktlarga moslashtirish uchun kontaktlarga kirish kerak";
NSLocationWhenInUseUsageDescription = "Bu joylashuvingizni boshqalar bilan baham ko'rish uchun kerak";
NSSpeechRecognitionUsageDescription = "Qurilmada tanish orqali ovozli xabarni matnga transkripsiya qilish uchun nutqni aniqlashga ruxsat kerak";
